
public class Zadacha7 {

	public static void main(String[] args) {
		// Напишете програма, която трансформира дадена матрица от
//		реални числа в символен низ, така че при отпечатване на
//		екрана на символния низ числата от матрицата да бъдат в
//		четим табличен вид с точност 2 цифри след десетичната точка.

		
		double[][] matrix={
				{1.31131,2.231,3.141,4.532},
				{5.224,6.532,7.632,8.325},
				{9.3264,10.345634234,11.234,12.3432}
		};
		
			String txt=	String.format("| %05.2f | %05.2f | %05.2f | %05.2f |\n| %05.2f | %05.2f | %05.2f | %05.2f |\n| %05.2f | %05.2f | %05.2f | %05.2f |",
			matrix[0][0],matrix[0][1],matrix[0][2],matrix[0][3],matrix[1][0],matrix[1][1],matrix[1][2],matrix[1][3],matrix[2][0],matrix[2][1],matrix[2][2],matrix[2][3]);
			System.out.println(txt);



	}
}
	